

const names = [ "Александр", "Алексей", "Анастасия", "Андрей", "Анна",
    "Артём", "Борис", "Вадим", "Валентин", "Валерия",
    "Василий", "Вера", "Вероника", "Виктор", "Виктория",
    "Владимир", "Владислав", "Галина", "Дарья", "Денис",
    "Дмитрий", "Евгений", "Евгения", "Екатерина", "Елена",
    "Иван", "Игорь", "Ирина", "Кирилл", "Константин",
    "Лариса", "Любовь", "Людмила", "Максим", "Марина",
    "Мария", "Михаил", "Надежда", "Наталья", "Никита",
    "Николай", "Олег", "Ольга", "Павел", "Полина",
    "Роман", "Светлана", "Сергей", "София", "Татьяна",
    "Юлия", "Яна"]

export const randomNameStore = {
    chooseName(){  
        return names[Math.floor(Math.random() * names.length)]
    }
}
